#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
module.lambda_s3.module.lambda-extract-judgement-contents.data.external.archive_prepare[0]: Reading...
module.lambda_s3.module.lambda-make-replacements.data.external.archive_prepare[0]: Reading...
module.lambda_s3.module.lambda-validate-replacements.data.external.archive_prepare[0]: Reading...
module.lambda_s3.module.lambda-update-legislation-table.data.external.archive_prepare[0]: Reading...
module.data.random_password.password: Refreshing state... [id=none]
module.data.module.metadata-db.random_password.master_password[0]: Refreshing state... [id=none]
module.data.module.metadata-db.random_id.snapshot_identifier[0]: Refreshing state... [id=dBZVvg]
module.lambda_s3.random_pet.this: Refreshing state... [id=measured-asp]
module.lambda_s3.module.lambda-validate-replacements.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.lambda_s3.module.lambda-extract-judgement-contents.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.lambda_s3.module.lambda-extract-judgement-contents.local_file.archive_plan[0]: Refreshing state... [id=e494ce8e773ad640bdb08bbd82edbffcbf018c9e]
module.lambda_s3.module.lambda-update-legislation-table.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.lambda_s3.module.lambda-make-replacements.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.lambda_s3.module.lambda-validate-replacements.local_file.archive_plan[0]: Refreshing state... [id=c94cd84e78147a36dbec2f6aa84c1ae056f90cfc]
module.lambda_s3.module.lambda-update-legislation-table.local_file.archive_plan[0]: Refreshing state... [id=b0bddc94ffd899ac547c4174564a97fc84afc36b]
module.lambda_s3.module.lambda-make-replacements.local_file.archive_plan[0]: Refreshing state... [id=8fb7ce91e0c8d4eb2aced5cda849217d98be7b46]
module.lambda_s3.module.lambda-validate-replacements.null_resource.archive[0]: Refreshing state... [id=1649675095127024634]
module.lambda_s3.module.lambda-extract-judgement-contents.null_resource.archive[0]: Refreshing state... [id=7323821322904470358]
module.lambda_s3.module.lambda-update-legislation-table.null_resource.archive[0]: Refreshing state... [id=4263719629446511109]
module.lambda_s3.module.lambda-make-replacements.null_resource.archive[0]: Refreshing state... [id=526530932230869329]
module.lambda_s3.module.lambda-update-legislation-table.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-update-legislation-table]
module.lambda_s3.module.rules_bucket.aws_kms_key.this[0]: Refreshing state... [id=b74573dd-48ef-4d5f-a0b7-c52618e18e38]
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-replacements-abbreviations]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.aws_sqs_queue.validation_updates_error_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-updates-error-queue]
module.lambda_s3.module.xml_second_phase_enriched_bucket.aws_kms_key.this[0]: Refreshing state... [id=dce4a465-2c1b-47cd-90d9-ca74da973ee8]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.network.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ec26bfba14257703]
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.aws_ecr_repository.abbreviations: Refreshing state... [id=tna-s3-tna-ecr-repository-abbreviations-production]
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.aws_ecr_repository.push_enriched_xml: Refreshing state... [id=tna-s3-tna-ecr-repository-push-enriched-xml-production]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.replacements_bucket.aws_kms_key.this[0]: Refreshing state... [id=034b72b5-edcf-4b5d-a074-0eaf9f88f6cd]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-replacements-legislation]
module.lambda_s3.module.text_content_bucket.aws_kms_key.this[0]: Refreshing state... [id=2f64d54a-6055-40c5-a540-64b32758b99f]
module.network.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0725f2fedcc386c04]
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-validate-replacements.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-push-enriched-xml.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-validate-replacements.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-push-enriched-xml.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-update-rules-processor.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-update-rules-processor]
module.lambda_s3.aws_sns_topic.legislation_detection_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-detection-error-topic]
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.aws_sns_topic.legislation_provisions_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-provisions-error-topic]
module.lambda_s3.aws_sns_topic.validation_updates_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-legislation-provisions]
module.lambda_s3.aws_secretsmanager_secret.sparql_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-s3-tna-sparql-password-production-wMXZCD]
module.lambda_s3.aws_ecr_repository.legislation-update: Refreshing state... [id=tna-s3-tna-ecr-repository-legislation-update-production]
module.lambda_s3.aws_secretsmanager_secret.API_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-s3-tna-api-password-production-V9Ae02]
module.lambda_s3.aws_sqs_queue.replacements-legislation_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-legislation-dlq-queue]
module.lambda_s3.aws_ecr_repository.legislation-provision: Refreshing state... [id=tna-s3-tna-ecr-repository-legislation-provision-production]
module.lambda_s3.aws_secretsmanager_secret.sparql_username: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-s3-tna-sparql-username-production-BOgQQF]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-replacements-caselaw]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-update-rules-processor.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_partition.current: Reading...
module.lambda_s3.aws_sns_topic.oblique_references_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:oblique-references-error-topic]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.aws_sns_topic.legislation_update_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-update-error-topic]
module.lambda_s3.aws_sns_topic.caselaw_detection_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:caselaw-detection-error-topic]
module.lambda_s3.aws_ecr_repository.rules-update: Refreshing state... [id=tna-s3-tna-ecr-repository-rules-update-production]
module.lambda_s3.aws_sqs_queue.validation_updates_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-updates-dlq-queue]
module.data.aws_rds_cluster_parameter_group.example: Refreshing state... [id=tna-aurora-postgres11-cluster-parameter-group]
module.lambda_s3.aws_sqs_queue.validation_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-dlq-queue]
module.data.aws_secretsmanager_secret.postgress_master_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-postgress-password-production-quaE0B]
module.data.module.metadata-db.data.aws_partition.current: Reading...
module.data.module.metadata-db.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.aws_cloudwatch_event_rule.update_legislation_table_lambda_event_rule: Refreshing state... [id=update-legislation-table-lambda-event-rule]
module.lambda_s3.module.lambda-make-replacements.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-make-replacements]
module.data.module.metadata-db.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.data.module.metadata-db.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.lambda_s3.aws_sqs_queue.replacements-abbreviations_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-abbreviations-dlq-queue]
module.lambda_s3.aws_sqs_queue.validation_updates_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-updates-queue]
module.lambda_s3.aws_ecr_repository.main: Refreshing state... [id=tna-s3-tna-ecr-repository-production]
module.lambda_s3.aws_sqs_queue.replacements_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-dlq-queue]
module.lambda_s3.aws_sqs_queue.validation_updates_error_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-updates-error-dlq-queue]
module.lambda_s3.aws_ecr_repository.fetch-xml: Refreshing state... [id=tna-s3-tna-ecr-repository-fetch-xml-production]
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.aws_sqs_queue.fetch_xml_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-fetch-xml-dlq-queue]
module.lambda_s3.aws_sns_topic.make_replacements_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:make-replacements-error-topic]
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.lambda_s3.module.lambda-make-replacements.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-make-replacements.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.container_bucket.aws_kms_key.this[0]: Refreshing state... [id=6bbabc6a-f828-40cf-9f7a-677f9777814b]
module.lambda_s3.aws_sns_topic.extract_judgement_contents_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:extract-judgement-contents-error-topic]
module.lambda_s3.aws_sns_topic.abbreviation_detection_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:abbreviation-detection-error-topic]
module.lambda_s3.module.lambda-fetch-xml.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-fetch-xml.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-extract-judgement-contents]
module.lambda_s3.aws_sns_topic.validation_updates: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-topic]
module.lambda_s3.module.lambda-update-legislation-table.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-update-legislation-table.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.data.aws_db_parameter_group.example: Refreshing state... [id=tna-aurora-db-postgres11-parameter-group]
module.lambda_s3.module.xml_third_phase_enriched_bucket.aws_kms_key.this[0]: Refreshing state... [id=f46f9937-e624-441e-bde2-36f5b1d8602a]
module.lambda_s3.module.lambda-push-enriched-xml.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-push-enriched-xml.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-determine-oblique-references.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-determine-oblique-references]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.module.lambda-fetch-xml.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_s3.module.lambda-fetch-xml.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2772594336]
module.lambda_s3.aws_secretsmanager_secret.API_username: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-s3-tna-api-username-production-GOCoGn]
module.lambda_s3.aws_ecr_repository.oblique-references: Refreshing state... [id=tna-s3-tna-ecr-repository-oblique-references-production]
module.lambda_s3.aws_ecr_repository.legislation: Refreshing state... [id=tna-s3-tna-ecr-repository-legislation-production]
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_partition.current: Reading...
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_s3.aws_sqs_queue.replacements-caselaw_dlq_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-caselaw-dlq-queue]
module.lambda_s3.module.xml_original_bucket.aws_kms_key.this[0]: Refreshing state... [id=d7044516-a847-4a57-9da7-af53e83880f5]
module.lambda_s3.module.xml_enriched_bucket.aws_kms_key.this[0]: Refreshing state... [id=5691ca21-acbf-4c32-a8c8-4875889d9919]
module.lambda_s3.module.lambda-fetch-xml.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-fetch-xml]
module.lambda_s3.module.lambda-make-replacements.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-make-replacements]
module.lambda_s3.module.lambda-validate-replacements.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/tna-s3-tna-production-xml-validate]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions]
module.lambda_s3.aws_sns_topic.rules_update_error: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:rules-update-error-topic]
module.lambda_s3.module.lambda-validate-replacements.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-xml-validate]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table]
module.lambda_s3.module.xml_second_phase_enriched_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-xml-second-phase-enriched-bucket-kms-key]
module.lambda_s3.module.rules_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-rules-bucket-kms-key]
module.lambda_s3.module.replacements_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-replacements-bucket-kms-key]
module.lambda_s3.module.text_content_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-text-content-bucket-kms-key]
module.lambda_s3.aws_sns_topic_subscription.legislation-provisions-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-provisions-error-topic:65f79a2a-86b9-4f65-9c9d-b3f7d41c0687]
module.lambda_s3.aws_cloudwatch_metric_alarm.legislation-provisions-error: Refreshing state... [id=Legislation provisions error]
module.lambda_s3.aws_sns_topic_subscription.legislation-detection-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-detection-error-topic:8496d661-8301-499c-85e6-4e15a394b63c]
module.lambda_s3.aws_cloudwatch_metric_alarm.legislation_detection_error: Refreshing state... [id=Legislation detection error]
module.lambda_s3.aws_sns_topic_subscription.validation-error-email-niall-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic:88a612d4-5988-4969-824a-415fcbde4647]
module.lambda_s3.aws_sns_topic_subscription.validation-error-email-dan-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic:9a21e128-a6e5-4e5b-ada6-d84bc2b2d8fe]
module.lambda_s3.aws_sns_topic_subscription.validation_updates_error_sqs_target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic:19aea0df-cb17-4a60-b10b-e209dffe2b49]
module.lambda_s3.aws_sqs_queue.replacement-legislation-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-legislation-event-notification-queue]
module.lambda_s3.aws_sns_topic_subscription.oblique-references-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:oblique-references-error-topic:02a0c89b-844f-42b3-bdb9-aeb3e5268697]
module.lambda_s3.aws_cloudwatch_metric_alarm.oblique-references_error: Refreshing state... [id=Oblique references error]
module.lambda_s3.aws_sns_topic_subscription.legislation-update-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:legislation-update-error-topic:b5f84a45-9390-4f4f-ac02-b76d396c9c59]
module.lambda_s3.aws_cloudwatch_metric_alarm.legislation_update_error: Refreshing state... [id=Legislation update error]
module.lambda_s3.aws_cloudwatch_metric_alarm.caselaw_detection_error: Refreshing state... [id=Case law detection error]
module.lambda_s3.aws_sns_topic_subscription.caselaw-detection-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:caselaw-detection-error-topic:30a5eebd-2888-465d-a602-dd05fd2c7dbb]
module.data.aws_secretsmanager_secret_version.postgress_master_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-postgress-password-production-quaE0B|1EE64283-60AC-44D5-A66D-5A8AE663E9B2]
module.lambda_s3.aws_sqs_queue.validation-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-event-notification-queue]
module.lambda_s3.aws_sqs_queue.replacement-abbreviations-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-abbreviations-event-notification-queue]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-extract-judgement-contents]
module.lambda_s3.aws_sqs_queue.replacements-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-queue]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor]
module.lambda_s3.aws_sqs_queue.fetch_xml_queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-fetch-xml-queue]
module.lambda_s3.aws_cloudwatch_metric_alarm.make_replacements_error: Refreshing state... [id=Replacements error]
module.lambda_s3.aws_sns_topic_subscription.make-replacements-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:make-replacements-error-topic:093d9ebf-36a0-4c22-b658-08f6d00c25ab]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations]
module.lambda_s3.module.lambda-fetch-xml.aws_iam_role.lambda[0]: Refreshing state... [id=tna-s3-tna-production-fetch-xml]
module.lambda_s3.aws_sns_topic_subscription.extract_judgement_contents_error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:extract-judgement-contents-error-topic:b60a421a-624a-4fa0-915a-65a6a924e934]
module.lambda_s3.aws_cloudwatch_metric_alarm.extract-judgement-contents-error: Refreshing state... [id=Extract judgement contents error]
module.lambda_s3.aws_sns_topic_subscription.abbreviation-detection-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:abbreviation-detection-error-topic:7ba6b297-5aa4-49e6-bfc9-48538475dffd]
module.lambda_s3.aws_cloudwatch_metric_alarm.abbreviation_detection_error: Refreshing state... [id=Abbreviation detection error]
module.lambda_s3.aws_sns_topic_subscription.validation_updates_sqs_target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:validation-updates-topic:7e7a09d2-6fc4-4440-b455-620747cfb9e4]
module.lambda_s3.module.container_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-container-bucket-kms-key]
module.lambda_s3.module.xml_third_phase_enriched_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-xml-third-phase-enriched-bucket-kms-key]
module.lambda_s3.aws_sqs_queue.replacement-caselaw-queue: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-caselaw-event-notification-queue]
module.lambda_s3.module.xml_original_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-xml-original-bucket-kms-key]
module.lambda_s3.module.xml_enriched_bucket.aws_kms_alias.this[0]: Refreshing state... [id=alias/production-tna-s3-tna-sg-xml-enriched-bucket-kms-key]
module.lambda_s3.module.xml_second_phase_enriched_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-second-phase-enriched-bucket]
module.lambda_s3.module.rules_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-rules-bucket]
module.lambda_s3.module.replacements_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-replacements-bucket]
module.lambda_s3.aws_cloudwatch_metric_alarm.rules_update_error: Refreshing state... [id=Manifest update error]
module.lambda_s3.aws_sns_topic_subscription.rules-error-email-dan-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:rules-update-error-topic:382ef4ce-d549-4c9a-b05f-2a1fd2e1a3db]
module.lambda_s3.aws_sns_topic_subscription.rules-error-email-editha-target: Refreshing state... [id=arn:aws:sns:eu-west-2:893937975773:rules-update-error-topic:b29ed7a3-a5de-4815-9528-80b495e1712c]
module.lambda_s3.module.text_content_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-text-content-bucket]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw-20220427202925002800000003]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw-20220427202925091300000004]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions-20220630134149431400000001]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions-20220630134149522500000002]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation-20220427202925571500000008]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation-20220427202925655800000009]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references-20220630134149618900000004]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references-20220630134149671100000005]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table-20220610094031848700000001]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table-20220610094031907600000003]
module.network.data.aws_subnets.private: Reading...
module.network.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0acc9193f0ee3b071]
module.network.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e54c3b6366c7757d]
module.network.module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0d7ba71e45f7ab5dc]
module.network.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01efa1af8517da831]
module.network.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-087c076b252dc37c2]
module.network.data.aws_subnets.private: Read complete after 1s [id=eu-west-2]
module.network.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06b211b2093d9386a]
module.network.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0b1d8f79187a7d21d]
module.network.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0b277ff77debc5626]
module.network.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-054799e9b0e828b66]
module.network.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-088c7e3e06dc5781a]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor-20220630134149804000000008]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor-20220630134149806900000009]
module.lambda_s3.aws_sqs_queue_policy.fetch_xml_queue_policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-fetch-xml-queue]
module.lambda_s3.aws_sns_topic_subscription.fetch_xml_queue_subscription: Refreshing state... [id=arn:aws:sns:eu-west-2:626206937213:caselaw-stg-judgment-updated:ebd9f242-64a9-43f4-a7e3-3d3eda47110b]
module.lambda_s3.module.container_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-container-bucket]
module.lambda_s3.module.xml_third_phase_enriched_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-third-phase-enriched-bucket]
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=625191347]
module.lambda_s3.module.xml_original_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-original-bucket]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=266729350]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations-20220427202925220500000007]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations-20220427202925208600000006]
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=47217208]
module.lambda_s3.module.xml_enriched_bucket.module.this.aws_s3_bucket.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-enriched-bucket]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1176325280]
module.lambda_s3.module.lambda-fetch-xml.aws_iam_role_policy_attachment.additional_many[0]: Refreshing state... [id=tna-s3-tna-production-fetch-xml-20221019102653452300000001]
module.lambda_s3.module.lambda-fetch-xml.aws_iam_role_policy_attachment.additional_many[1]: Refreshing state... [id=tna-s3-tna-production-fetch-xml-20221019102653577300000003]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=17487163]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3872817847]
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=571018137]
module.network.aws_vpc_endpoint.secrets_manager["subnet-01efa1af8517da831"]: Refreshing state... [id=vpce-00356813d8fd3cd88]
module.network.aws_vpc_endpoint.secrets_manager["subnet-087c076b252dc37c2"]: Refreshing state... [id=vpce-0f96c81fa60ad2e45]
module.network.data.aws_subnet.private["subnet-01efa1af8517da831"]: Reading...
module.network.data.aws_subnet.private["subnet-087c076b252dc37c2"]: Reading...
module.network.data.aws_subnet.private["subnet-01efa1af8517da831"]: Read complete after 1s [id=subnet-01efa1af8517da831]
module.network.module.vpc.aws_route.database_internet_gateway[0]: Refreshing state... [id=r-rtb-0d7ba71e45f7ab5dc1080289494]
module.network.data.aws_subnet.private["subnet-087c076b252dc37c2"]: Read complete after 1s [id=subnet-087c076b252dc37c2]
module.network.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0db69f07ac9c5b962]
module.network.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0eaba2ceacaec8bde]
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1403257194]
module.network.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06b211b2093d9386a1080289494]
module.network.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-00ac06519141b2c48]
module.network.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0635f4073668232a5]
module.network.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=tna-network-vpc-production]
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2875564545]
module.lambda_s3.module.lambda-fetch-xml.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-fetch-xml.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2155874248]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-update-legislation-table-logs]
module.network.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0b8f5e3c07bc8fabb]
module.network.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dbaa914eb827c84f]
module.network.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0224c4f97dd4ef418]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-abbreviations-logs]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-legislation-logs]
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3290068938]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-update-rules-processor-logs]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-legislation-provisions-logs]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-caselaw-logs]
module.lambda_s3.module.lambda-make-replacements.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-make-replacements-logs]
module.data.data.aws_subnets.database: Reading...
module.data.data.aws_vpc.vpc: Reading...
module.data.data.aws_subnets.public: Reading...
module.data.data.aws_subnets.private: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-extract-judgement-contents-logs]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-oblique-references-logs]
module.data.data.aws_subnets.database: Read complete after 1s [id=eu-west-2]
module.lambda_s3.module.lambda-fetch-xml.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-fetch-xml-logs]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table-20220610094032359700000004]
module.lambda_s3.module.replacements_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-replacements-bucket]
module.data.data.aws_subnets.public: Read complete after 1s [id=eu-west-2]
module.lambda_s3.module.rules_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-rules-bucket]
module.lambda_s3.module.xml_second_phase_enriched_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-second-phase-enriched-bucket]
module.network.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0acc9193f0ee3b0711080289494]
module.data.data.aws_subnets.private: Read complete after 0s [id=eu-west-2]
module.lambda_s3.module.text_content_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-text-content-bucket]
module.lambda_s3.module.lambda-validate-replacements.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-xml-validate-logs]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations-2022042720294337040000000b]
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-update-legislation-table.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3630805794]
module.lambda_s3.module.lambda-push-enriched-xml.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-push-enriched-xml.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=954851574]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation-2022042720294327780000000a]
module.data.module.metadata-db.aws_security_group.this[0]: Refreshing state... [id=sg-09faed2a726d79566]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor-2022063013415009100000000a]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions-2022063013415031910000000c]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw-2022042720294425200000000c]
module.lambda_s3.module.lambda-make-replacements.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-make-replacements-2022042720294437830000000f]
module.data.data.aws_subnet.database["subnet-0b277ff77debc5626"]: Reading...
module.data.data.aws_subnet.database["subnet-0b1d8f79187a7d21d"]: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-extract-judgement-contents-2022042720294427700000000d]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references-2022063013415011700000000b]
module.data.data.aws_subnet.public["subnet-054799e9b0e828b66"]: Reading...
module.data.data.aws_subnet.public["subnet-088c7e3e06dc5781a"]: Reading...
module.lambda_s3.module.lambda-fetch-xml.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-fetch-xml-20221019102654240900000004]
module.data.data.aws_subnet.private["subnet-01efa1af8517da831"]: Reading...
module.data.data.aws_subnet.private["subnet-087c076b252dc37c2"]: Reading...
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-update-legislation-table-inline]
module.lambda_s3.module.container_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-container-bucket]
module.lambda_s3.module.lambda-validate-replacements.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=tna-s3-tna-production-xml-validate-20220427202944441100000010]
module.data.data.aws_subnet.database["subnet-0b277ff77debc5626"]: Read complete after 0s [id=subnet-0b277ff77debc5626]
module.data.module.metadata-db.aws_db_subnet_group.this[0]: Refreshing state... [id=tna-metadata-db-production]
module.data.data.aws_subnet.database["subnet-0b1d8f79187a7d21d"]: Read complete after 0s [id=subnet-0b1d8f79187a7d21d]
module.lambda_s3.module.xml_original_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-original-bucket]
module.data.data.aws_vpc.vpc: Read complete after 2s [id=vpc-0725f2fedcc386c04]
module.lambda_s3.module.xml_third_phase_enriched_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-third-phase-enriched-bucket]
module.lambda_s3.module.xml_enriched_bucket.module.this.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=production-tna-s3-tna-sg-xml-enriched-bucket]
module.data.data.aws_subnet.public["subnet-088c7e3e06dc5781a"]: Read complete after 0s [id=subnet-088c7e3e06dc5781a]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.data.data.aws_subnet.public["subnet-054799e9b0e828b66"]: Read complete after 0s [id=subnet-054799e9b0e828b66]
module.lambda_s3.module.lambda-update-rules-processor.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=222784184]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-extract-judgement-contents]
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-legislation.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1037661573]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-abbreviations.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3238369102]
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-determine-replacements-caselaw.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1519427654]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations]
module.data.data.aws_subnet.private["subnet-01efa1af8517da831"]: Read complete after 0s [id=subnet-01efa1af8517da831]
module.lambda_s3.module.lambda-determine-oblique-references.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references]
module.data.data.aws_subnet.private["subnet-087c076b252dc37c2"]: Read complete after 0s [id=subnet-087c076b252dc37c2]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-update-rules-processor-inline]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-legislation-inline]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-abbreviations-inline]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-replacements-caselaw-inline]
module.lambda_s3.module.lambda-fetch-xml.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-fetch-xml]
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-extract-judgement-contents.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=4724938]
module.lambda_s3.module.lambda-fetch-xml.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-fetch-xml.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1884768237]
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-determine-legislation-provisions.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2554887954]
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-validate-replacements.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348118306]
module.lambda_s3.module.lambda-validate-replacements.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-xml-validate]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions]
module.lambda_s3.module.lambda-update-legislation-table.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table-20220610094031903400000002]
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-determine-oblique-references.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1482319532]
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.lambda_s3.module.lambda-make-replacements.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3938526842]
module.lambda_s3.module.lambda-make-replacements.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-make-replacements]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-extract-judgement-contents-inline]
module.lambda_s3.module.lambda-fetch-xml.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-fetch-xml-inline]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-legislation-provisions-inline]
module.lambda_s3.module.lambda-validate-replacements.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-xml-validate-inline]
module.lambda_s3.module.lambda-update-rules-processor.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor-20220630134149803700000007]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation-20220427203012648200000014]
module.lambda_s3.module.lambda-determine-replacements-abbreviations.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-abbreviations-20220427203011908400000012]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-determine-oblique-references-inline]
module.lambda_s3.module.lambda-make-replacements.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::893937975773:policy/tna-s3-tna-production-make-replacements-inline]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw-20220427203012638700000013]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-extract-judgement-contents-20220427203004315000000011]
module.lambda_s3.module.lambda-fetch-xml.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-fetch-xml-20221019102653459700000002]
module.lambda_s3.module.lambda-determine-oblique-references.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-legislation-provisions-20220630134149565800000003]
module.data.module.metadata-db.aws_rds_cluster.this[0]: Refreshing state... [id=tna-metadata-db-production]
module.lambda_s3.module.lambda-fetch-xml.aws_lambda_permission.unqualified_alias_triggers["sqs"]: Refreshing state... [id=sqs]
module.lambda_s3.aws_lambda_event_source_mapping.sqs_replacements_legislation_event_source_mapping: Refreshing state... [id=b97e763c-8afc-402d-8978-f2fd27135f1e]
module.lambda_s3.aws_sqs_queue_policy.replacements-abbreviations-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-abbreviations-event-notification-queue]
module.lambda_s3.module.lambda-validate-replacements.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-xml-validate-20220427203017047200000016]
module.lambda_s3.module.lambda-determine-legislation-provisions.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_s3_bucket_notification.xml_enriched_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-xml-enriched-bucket]
module.lambda_s3.module.lambda-extract-judgement-contents.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.module.lambda-determine-oblique-references.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-determine-oblique-references-20220630134149708200000006]
module.lambda_s3.module.lambda-make-replacements.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=tna-s3-tna-production-make-replacements-20220427203017040500000015]
module.lambda_s3.aws_s3_bucket_notification.xml_second_phase_enriched_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-xml-second-phase-enriched-bucket]
module.lambda_s3.aws_s3_bucket_notification.xml_original_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-xml-original-bucket]
module.lambda_s3.module.lambda-validate-replacements.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_s3_bucket_notification.xml_third_phase_enriched_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-xml-third-phase-enriched-bucket]
module.lambda_s3.aws_lambda_event_source_mapping.sqs_replacements_abbreviations_event_source_mapping: Refreshing state... [id=dcc2765f-1f9c-458c-9a52-5abb8037109f]
module.lambda_s3.aws_sqs_queue_policy.validation-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-validation-event-notification-queue]
module.lambda_s3.aws_sqs_queue_policy.replacements-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacements-queue]
module.data.module.metadata-db.aws_security_group_rule.cidr_ingress[0]: Refreshing state... [id=sgrule-2191776492]
module.data.module.metadata-db.aws_rds_cluster_instance.this[0]: Refreshing state... [id=tna-metadata-db-production-1]
module.lambda_s3.module.lambda-update-rules-processor.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-update-rules-processor]
module.lambda_s3.module.lambda-determine-replacements-legislation.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-legislation]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-determine-replacements-caselaw]
module.lambda_s3.module.lambda-update-legislation-table.aws_lambda_function.this[0]: Refreshing state... [id=tna-s3-tna-production-update-legislation-table]
module.lambda_s3.module.lambda-determine-replacements-caselaw.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_sqs_queue_policy.replacement-caselaw-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-caselaw-event-notification-queue]
module.lambda_s3.aws_s3_bucket_notification.text_content_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-text-content-bucket]
module.lambda_s3.module.lambda-update-rules-processor.aws_lambda_permission.unqualified_alias_triggers["S3BucketUpload"]: Refreshing state... [id=S3BucketUpload]
module.lambda_s3.aws_lambda_event_source_mapping.sqs_replacements_event_source_mapping_caselaw: Refreshing state... [id=cf24034e-11ca-46bf-aa78-a8c54603cfda]
module.lambda_s3.aws_sqs_queue_policy.replacement-legislation-queue-policy: Refreshing state... [id=https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-replacement-legislation-event-notification-queue]
module.lambda_s3.aws_s3_bucket_notification.rules_bucket_notification: Refreshing state... [id=production-tna-s3-tna-sg-rules-bucket]
module.lambda_s3.aws_lambda_permission.allow_cloudwatch_to_call_rw_fallout_retry_step_deletion_lambda: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.lambda_s3.aws_cloudwatch_event_target.update_legislation_table_lambda_target: Refreshing state... [id=update-legislation-table-lambda-event-rule-terraform-20220630135637662100000005]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lambda_s3.module.lambda-fetch-xml.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "tna-s3-tna-production-fetch-xml"
      ~ last_modified                  = "2022-10-19T10:27:38.805+0000" -> "2022-10-25T07:38:39.000+0000"
      ~ source_code_hash               = "3a364160b07f23babd692c921f4b7cf1192104b10e8e87910d373c7caafa88d6" -> "8dc71edf72f4379493a18b29f3786d629f1d5e687bb168ecb58c2d873a6511bd"
        tags                           = {
            "Environment" = "production"
            "Project"     = "TNA-enrichment"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_s3.aws_lambda_event_source_mapping.sqs_replacements_fetch_xml_event_source_mapping will be created
  + resource "aws_lambda_event_source_mapping" "sqs_replacements_fetch_xml_event_source_mapping" {
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:eu-west-2:893937975773:tna-s3-tna-production-fetch-xml-queue"
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:eu-west-2:893937975773:function:tna-s3-tna-production-fetch-xml"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.lambda_s3.aws_sns_topic_subscription.validation-error-email-niall-target will be created
  + resource "aws_sns_topic_subscription" "validation-error-email-niall-target" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "niall.roche@mdrx.tech"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:893937975773:validation-updates-error-topic"
    }

  # module.lambda_s3.aws_sqs_queue.fetch_xml_queue will be updated in-place
  ~ resource "aws_sqs_queue" "fetch_xml_queue" {
        id                                = "https://sqs.eu-west-2.amazonaws.com/893937975773/tna-s3-tna-production-fetch-xml-queue"
        name                              = "tna-s3-tna-production-fetch-xml-queue"
        tags                              = {
            "Environment" = "production"
            "Project"     = "TNA-enrichment"
        }
      ~ visibility_timeout_seconds        = 30 -> 900
        # (13 unchanged attributes hidden)
    }

  # module.lambda_s3.module.lambda-extract-judgement-contents.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7323821322904470358" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1666192790091572000" -> "1666689409798456000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_s3.module.lambda-fetch-xml.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::893937975773:policy/tna-s3-tna-production-fetch-xml-inline"
        name      = "tna-s3-tna-production-fetch-xml-inline"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:CreateLogStream",
                            "logs:CreateLogGroup",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "loglambda"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::production-tna-s3-tna-sg-xml-original-bucket/*"
                      + Sid      = "s3put"
                    },
                    {
                        Action   = [
                            "s3:List*",
                            "s3:HeadObject",
                            "s3:GetObjectVersion",
                            "s3:GetObject",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "s3read"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {
            "Environment" = "production"
            "Project"     = "TNA-enrichment"
        }
        # (4 unchanged attributes hidden)
    }

  # module.lambda_s3.module.lambda-fetch-xml.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "tna-s3-tna-production-fetch-xml"
      ~ image_uri                      = "893937975773.dkr.ecr.eu-west-2.amazonaws.com/tna-s3-tna-ecr-repository-fetch-xml-production@sha256:8dc71edf72f4379493a18b29f3786d629f1d5e687bb168ecb58c2d873a6511bd" -> "893937975773.dkr.ecr.eu-west-2.amazonaws.com/tna-s3-tna-ecr-repository-fetch-xml-production:latest"
      ~ last_modified                  = "2022-10-25T07:38:39.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "production"
            "Project"     = "TNA-enrichment"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_s3.module.lambda-fetch-xml.aws_lambda_permission.unqualified_alias_triggers["sqs"] will be destroyed
  # (because key ["sqs"] is not in for_each map)
  - resource "aws_lambda_permission" "unqualified_alias_triggers" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "tna-s3-tna-production-fetch-xml" -> null
      - id            = "sqs" -> null
      - principal     = "sqs.amazonaws.com" -> null
      - source_arn    = "arn:aws:sqs:eu-west-2:893937975773:tna-s3-tna-production-fetch-xml-queue" -> null
      - statement_id  = "sqs" -> null
    }

  # module.lambda_s3.module.lambda-make-replacements.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "526530932230869329" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1666192790128687000" -> "1666689409796372800"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/tna-s3-tna-production-push-enriched-xml"
      + retention_in_days = 0
      + tags              = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + tags_all          = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tna-s3-tna-production-push-enriched-xml-inline"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:ReEncryptTo",
                          + "kms:GenerateDataKey",
                          + "kms:Encrypt",
                          + "kms:DescribeKey",
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "kmsgetkey"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "loglambda"
                    },
                  + {
                      + Action   = [
                          + "s3:List*",
                          + "s3:HeadObject",
                          + "s3:GetObjectVersion",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "s3read"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:eu-west-2:893937975773:secret:tna-postgress-password-production-quaE0B"
                      + Sid      = "secretsget"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags      = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + tags_all  = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "tna-s3-tna-production-push-enriched-xml-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + tags_all  = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "accountroot"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tna-s3-tna-production-push-enriched-xml"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tna-s3-tna-production-push-enriched-xml"
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.aws_iam_role_policy_attachment.additional_many[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_many" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "tna-s3-tna-production-push-enriched-xml"
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.aws_iam_role_policy_attachment.additional_many[1] will be created
  + resource "aws_iam_role_policy_attachment" "additional_many" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "tna-s3-tna-production-push-enriched-xml"
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tna-s3-tna-production-push-enriched-xml"
    }

  # module.lambda_s3.module.lambda-push-enriched-xml.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "tna-s3-tna-production-push-enriched-xml"
      + id                             = (known after apply)
      + image_uri                      = "893937975773.dkr.ecr.eu-west-2.amazonaws.com/tna-s3-tna-ecr-repository-fetch-xml-production:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + tags_all                       = {
          + "Environment" = "production"
          + "Project"     = "TNA-enrichment"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0f74fb911a6367d55",
            ]
          + subnet_ids         = [
              + "subnet-01efa1af8517da831",
              + "subnet-087c076b252dc37c2",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.lambda_s3.module.lambda-update-legislation-table.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4263719629446511109" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1666192790136863000" -> "1666689409787608000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_s3.module.lambda-validate-replacements.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1649675095127024634" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1666192790109083000" -> "1666689409787543000"
            # (1 unchanged element hidden)
        }
    }

Plan: 15 to add, 3 to change, 5 to destroy.

Warning: Argument is deprecated

  with module.lambda_s3.module.container_bucket.module.this.aws_s3_bucket.this,
  on .terraform/modules/lambda_s3.container_bucket.this/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_website_configuration resource instead

(and 119 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @ak-mdrxtech, Action: `pull_request`*